# pivot table

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [10]:
df.groupby(['sex', 'class'])[['survived']].aggregate('mean').unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [11]:
# pivot ile table

In [12]:
df.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [14]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [19]:
age = pd.cut(df['age'], bins=[0, 19, 90], labels=['Çocuk', 'Yetişkin'])
age

0      Yetişkin
1      Yetişkin
2      Yetişkin
3      Yetişkin
4      Yetişkin
         ...
886    Yetişkin
887       Çocuk
888         NaN
889    Yetişkin
890    Yetişkin
Name: age, Length: 891, dtype: category
Categories (2, object): ['Çocuk' < 'Yetişkin']

In [26]:
age.value_counts()

Yetişkin    550
Çocuk       164
Name: age, dtype: int64

In [32]:
age = pd.cut(df.age, [0, 19, 90])

In [38]:
df.pivot_table('survived', index=['sex', age], columns='class')

class               First    Second     Third
sex    age
female (0, 19]   0.928571  1.000000  0.533333
       (19, 90]  0.971831  0.896552  0.403509
male   (0, 19]   0.571429  0.526316  0.190476
       (19, 90]  0.382979  0.062500  0.136842